In [1]:
import pandas as pd

In [2]:
data = {
'2021' : [1116, 12259, 16699, 65119],
'2020' : [628, 11075, 15695, 56013],
'2019' : [678,12700,15148,55443],
'2018' : [712, 13597, 16052, 56024],
'농지면적순위' : [4,3,2,1]
}
columns = ['농지면적순위', '2021', '2020', '2019', '2018']
index = ['서울','부산','대구','인천']
df = pd.DataFrame(data, index=index, columns=columns)
df

    농지면적순위   2021   2020   2019   2018
서울       4   1116    628    678    712
부산       3  12259  11075  12700  13597
대구       2  16699  15695  15148  16052
인천       1  65119  56013  55443  56024

In [3]:
df.columns

Index(['농지면적순위', '2021', '2020', '2019', '2018'], dtype='object')

In [4]:
df.index

Index(['서울', '부산', '대구', '인천'], dtype='object')

In [5]:
df.values

array([[    4,  1116,   628,   678,   712],
       [    3, 12259, 11075, 12700, 13597],
       [    2, 16699, 15695, 15148, 16052],
       [    1, 65119, 56013, 55443, 56024]], dtype=int64)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 서울 to 인천
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   농지면적순위  4 non-null      int64
 1   2021    4 non-null      int64
 2   2020    4 non-null      int64
 3   2019    4 non-null      int64
 4   2018    4 non-null      int64
dtypes: int64(5)
memory usage: 192.0+ bytes

In [7]:
df.index.name = '지역'

In [8]:
df

    농지면적순위   2021   2020   2019   2018
지역
서울       4   1116    628    678    712
부산       3  12259  11075  12700  13597
대구       2  16699  15695  15148  16052
인천       1  65119  56013  55443  56024

In [9]:
df.columns.name = '특성'

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 서울 to 인천
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   농지면적순위  4 non-null      int64
 1   2021    4 non-null      int64
 2   2020    4 non-null      int64
 3   2019    4 non-null      int64
 4   2018    4 non-null      int64
dtypes: int64(5)
memory usage: 192.0+ bytes

In [11]:
df['2018-2021 변화율'] = ((df['2021'] - df['2018'])/ df['2018']* 100)

In [12]:
df = df[['2018', '2019','2020','2021','농지면적순위','2018-2021 변화율']]

In [13]:
df

특성   2018   2019   2020   2021  농지면적순위  2018-2021 변화율
지역
서울    712    678    628   1116       4      56.741573
부산  13597  12700  11075  12259       3      -9.840406
대구  16052  15148  15695  16699       2       4.030650
인천  56024  55443  56013  65119       1      16.234114

In [14]:
df['2018-2021 변화율'] = df['2018-2021 변화율'].astype(int)
df.T

지역               서울     부산     대구     인천
특성
2018            712  13597  16052  56024
2019            678  12700  15148  55443
2020            628  11075  15695  56013
2021           1116  12259  16699  65119
농지면적순위            4      3      2      1
2018-2021 변화율    56     -9      4     16

In [15]:
df['2018']['서울']

712

In [16]:
temp = pd.Series(['a','b','c','d','e'])

In [17]:
temp[0]

'a'

In [18]:
print(df['2021']['서울'])
print(df['2021'][0])

1116
1116

In [19]:
df

특성   2018   2019   2020   2021  농지면적순위  2018-2021 변화율
지역
서울    712    678    628   1116       4             56
부산  13597  12700  11075  12259       3             -9
대구  16052  15148  15695  16699       2              4
인천  56024  55443  56013  65119       1             16

In [20]:
df.sort_values(by='2018-2021 변화율')

특성   2018   2019   2020   2021  농지면적순위  2018-2021 변화율
지역
부산  13597  12700  11075  12259       3             -9
대구  16052  15148  15695  16699       2              4
인천  56024  55443  56013  65119       1             16
서울    712    678    628   1116       4             56

In [21]:
temp_list = [1,2,3,4]
temp_list[:2]

[1, 2]

In [22]:
df[1:2]

특성   2018   2019   2020   2021  농지면적순위  2018-2021 변화율
지역
부산  13597  12700  11075  12259       3             -9

In [23]:
df['서울':'부산']

특성   2018   2019   2020   2021  농지면적순위  2018-2021 변화율
지역
서울    712    678    628   1116       4             56
부산  13597  12700  11075  12259       3             -9

In [24]:
# loc, iloc
df.loc[['부산', '대구']]

특성   2018   2019   2020   2021  농지면적순위  2018-2021 변화율
지역
부산  13597  12700  11075  12259       3             -9
대구  16052  15148  15695  16699       2              4

In [25]:
df.iloc[0,0]

712

In [26]:
df['2018']['서울']

712

In [27]:
df.iloc[0][0]

712

In [28]:
df['2018-2021 변화율'] = df['2018-2021 변화율'].astype(float)

In [29]:
df.iloc[0][0]

712.0

In [30]:
df.iloc[0,0]

712

In [31]:
index = ['철수','영희','길동','슬기']
columns = ['국어','영어','수학','과학']
data = {
    '국어' : [80,90,70,50],
    '영어' : [90,50,60,100],
    '수학' : [70,100,50,70],
    '과학' : [30,50,80,80]
}
df_p1 = pd.DataFrame(data, index=index, columns=columns)

In [32]:
df_p1

    국어   영어   수학  과학
철수  80   90   70  30
영희  90   50  100  50
길동  70   60   50  80
슬기  50  100   70  80

In [33]:
df_p1['평균'] = df_p1.mean(axis=1)

In [34]:
df_p1.loc['평균'] = df_p1.mean()

In [35]:
df_p1

      국어     영어     수학    과학    평균
철수  80.0   90.0   70.0  30.0  67.5
영희  90.0   50.0  100.0  50.0  72.5
길동  70.0   60.0   50.0  80.0  65.0
슬기  50.0  100.0   70.0  80.0  75.0
평균  72.5   75.0   72.5  60.0  70.0

In [36]:
(df_p1['국어'] + df_p1['영어'] + df_p1['수학'] + df_p1['과학']) / 4

철수    67.5
영희    72.5
길동    65.0
슬기    75.0
평균    70.0
dtype: float64

In [37]:
df_p1['학생평균'] = (df_p1['국어'] + df_p1['영어'] + df_p1['수학'] + df_p1['과학']) / 4

In [38]:
df_p1

      국어     영어     수학    과학    평균  학생평균
철수  80.0   90.0   70.0  30.0  67.5  67.5
영희  90.0   50.0  100.0  50.0  72.5  72.5
길동  70.0   60.0   50.0  80.0  65.0  65.0
슬기  50.0  100.0   70.0  80.0  75.0  75.0
평균  72.5   75.0   72.5  60.0  70.0  70.0

In [39]:
df_p1.loc['과목평균'] = (df_p1.loc['철수'] + df_p1.loc['영희'] + df_p1.loc['길동'] + df_p1.loc['슬기']) / 4

In [40]:
df_p1

        국어     영어     수학    과학    평균  학생평균
철수    80.0   90.0   70.0  30.0  67.5  67.5
영희    90.0   50.0  100.0  50.0  72.5  72.5
길동    70.0   60.0   50.0  80.0  65.0  65.0
슬기    50.0  100.0   70.0  80.0  75.0  75.0
평균    72.5   75.0   72.5  60.0  70.0  70.0
과목평균  72.5   75.0   72.5  60.0  70.0  70.0